taylorCouetteGym/taylor_couette_mixing/cases/full_tc_mixing_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Kinematic pressure (p/rho). Pressure reference fixed at the bottom outlet.
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    object          p;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inner_wall
    {
        type            zeroGradient;
    }
    outer_wall
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
