taylorCouetteGym/taylor_couette_mixing/cases/full_tc_mixing_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inner_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1152;
        startFace       25920;
    }
    outer_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1152;
        startFace       27072;
    }
    top
    {
        type            patch;
        nFaces          576;
        startFace       28224;
    }
    bottom
    {
        type            patch;
        nFaces          576;
        startFace       28800;
    }
)

// ************************************************************************* //
