taylorCouetteGym/taylor_couette_mixing/cases/full_tc_mixing_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     pimpleFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         2;

deltaT          0.001;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression no;

timeFormat      general;

timePrecision   9;

runTimeModifiable no;

functions
{
    scalarTransport
    {
        type            scalarTransport;
        libs            ( solverFunctionObjects );
        field           C;
        resetOnStartUp  false;
        schemesField    C;
        D               1e-09;
        nCorr           1;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
    }
    rlMetrics
    {
        type            coded;
        libs            ( utilityFunctionObjects );
        name            rlMetrics;
        codeOptions     #{
            -I$(LIB_SRC)/TurbulenceModels/turbulenceModels/lnInclude \
            -I$(LIB_SRC)/TurbulenceModels/incompressible/lnInclude \
            -I$(LIB_SRC)/transportModels \
            -I$(LIB_SRC)/transportModels/incompressible/lnInclude
        #};
        codeLibs        #{
            -lincompressibleTurbulenceModels \
            -lturbulenceModels \
            -lincompressibleTransportModels
        #};
        codeInclude     #{
            #include "turbulentTransportModel.H"
        #};
        codeExecute     #{
            const fvMesh& mesh = dynamic_cast<const fvMesh&>(this->mesh());
            const Time&   runTime = mesh.time();

            const volScalarField& C = mesh.lookupObject<volScalarField>("C");
            const volVectorField& U = mesh.lookupObject<volVectorField>("U");

            // ---------- 20 radial bins at the bottom outlet ----------
            const label bottomID = mesh.boundaryMesh().findPatchID("bottom");
            const scalar Rin  = 0.038;
            const scalar Rout = 0.04035;
            const label  nBins = 20;
            scalarField  binC(nBins, 0.0);
            scalarField  binVz(nBins, 0.0);
            scalarField  binW(nBins, 0.0);

            if (bottomID >= 0)
            {
                const scalarField& Cb = C.boundaryField()[bottomID];
                const vectorField& Ub = U.boundaryField()[bottomID];
                const vectorField& Cf = mesh.Cf().boundaryField()[bottomID];
                const scalarField  magSf(mag(mesh.Sf().boundaryField()[bottomID]));

                forAll(Cb, i)
                {
                    scalar r = sqrt(sqr(Cf[i].x()) + sqr(Cf[i].y()));
                    label  b = label((r - Rin) / (Rout - Rin) * nBins);
                    if (b < 0) b = 0;
                    if (b >= nBins) b = nBins - 1;
                    binC[b]  += Cb[i] * magSf[i];
                    binVz[b] += Ub[i].z() * magSf[i];
                    binW[b]  += magSf[i];
                }
            }
            reduce(binC,  sumOp<scalarField>());
            reduce(binVz, sumOp<scalarField>());
            reduce(binW,  sumOp<scalarField>());
            forAll(binC, b)
            {
                if (binW[b] > SMALL)
                {
                    binC[b]  /= binW[b];
                    binVz[b] /= binW[b];
                }
            }

            // ---------- Viscous torque on the inner cylinder ----------
            const label innerID = mesh.boundaryMesh().findPatchID("inner_wall");

            const incompressible::turbulenceModel& turb =
                mesh.lookupObject<incompressible::turbulenceModel>
                ("turbulenceProperties");

            tmp<volSymmTensorField> tdevReff = turb.devReff();
            const volSymmTensorField& devReff = tdevReff();

            vector M(vector::zero);
            if (innerID >= 0)
            {
                const vectorField& Sf  = mesh.Sf().boundaryField()[innerID];
                const vectorField& Cf  = mesh.Cf().boundaryField()[innerID];
                const symmTensorField& tauB = devReff.boundaryField()[innerID];

                forAll(Sf, i)
                {
                    M += (Cf[i] ^ (tauB[i] & Sf[i]));
                }
            }
            reduce(M, sumOp<vector>());

            // ---------- Log: t, Mz (kinematic), C and Vz values ----------
            Info<< "METRICS t=" << runTime.value()
                << " Mz_kin=" << M.z();
            forAll(binC, b)
            {
                Info<< " C" << b << "=" << binC[b];
            }
            forAll(binVz, b)
            {
                Info<< " Vz" << b << "=" << binVz[b];
            }
            Info<< endl;
        #};
    }
}


// ************************************************************************* //
